thonv54/IR-PIR/Lib/mc9s08pt16.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile TSI_CNTSTR _TSI_CNT;                              /* TSI Counter Register; 0x0000000E */
volatile ADC_RSTR _ADC_R;                                  /* Data Result Register; 0x00000014 */
volatile ADC_CVSTR _ADC_CV;                                /* Compare Value Register; 0x00000016 */
volatile FTM0_CNTSTR _FTM0_CNT;                            /* FTM0 Timer Counter Register; 0x00000021 */
volatile FTM0_MODSTR _FTM0_MOD;                            /* FTM0 Timer Counter Modulo Register; 0x00000023 */
volatile FTM0_C0VSTR _FTM0_C0V;                            /* FTM0 Timer Channel 0 Value Register; 0x00000026 */
volatile FTM0_C1VSTR _FTM0_C1V;                            /* FTM0 Timer Channel 1 Value Register; 0x00000029 */
volatile SYS_SDIDSTR _SYS_SDID;                            /* System Device Identification Register; 0x00003002 */
volatile NVM_FCCOBSTR _NVM_FCCOB;                          /* Flash Common Command Object Register; 0x0000302A */
volatile WDOG_CNTSTR _WDOG_CNT;                            /* Watchdog Counter Register; 0x00003032 */
volatile WDOG_TOVALSTR _WDOG_TOVAL;                        /* Watchdog Timer Register; 0x00003034 */
volatile WDOG_WINSTR _WDOG_WIN;                            /* Watchdog Window Register; 0x00003036 */
volatile CRC_D0D1STR _CRC_D0D1;                            /* CRC_D0D1 register; 0x00003060 */
volatile CRC_D2D3STR _CRC_D2D3;                            /* CRC_D2D3 register; 0x00003062 */
volatile CRC_P0P1STR _CRC_P0P1;                            /* CRC_P0P1 register; 0x00003064 */
volatile CRC_P2P3STR _CRC_P2P3;                            /* CRC_P2P3 register; 0x00003066 */
volatile RTC_MODSTR _RTC_MOD;                              /* RTC Modulo Register; 0x0000306C */
volatile RTC_CNTSTR _RTC_CNT;                              /* RTC Counter Register; 0x0000306E */
volatile I2C_SLTSTR _I2C_SLT;                              /* I2C SCL Low Timeout register; 0x0000307A */
volatile SCI0_BDSTR _SCI0_BD;                              /* SCI0 Baud Rate Register; 0x00003080 */
volatile SCI1_BDSTR _SCI1_BD;                              /* SCI1 Baud Rate Register; 0x00003088 */
volatile FTM2_CNTSTR _FTM2_CNT;                            /* FTM2 Timer Counter Register; 0x000030C1 */
volatile FTM2_MODSTR _FTM2_MOD;                            /* FTM2 Timer Counter Modulo Register; 0x000030C3 */
volatile FTM2_C0VSTR _FTM2_C0V;                            /* FTM2 Timer Channel 0 Value Register; 0x000030C6 */
volatile FTM2_C1VSTR _FTM2_C1V;                            /* FTM2 Timer Channel 1 Value Register; 0x000030C9 */
volatile FTM2_C2VSTR _FTM2_C2V;                            /* FTM2 Timer Channel 2 Value Register; 0x000030CC */
volatile FTM2_C3VSTR _FTM2_C3V;                            /* FTM2 Timer Channel 3 Value Register; 0x000030CF */
volatile FTM2_C4VSTR _FTM2_C4V;                            /* FTM2 Timer Channel 4 Value Register; 0x000030D2 */
volatile FTM2_C5VSTR _FTM2_C5V;                            /* FTM2 Timer Channel 5 Value Register; 0x000030D5 */
volatile FTM2_CNTINSTR _FTM2_CNTIN;                        /* FTM2 Counter Initial Value Registers; 0x000030D7 */

/*lint -restore */

/* EOF */
